In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series(np.random.randint(10,size=5))
data

0    8
1    8
2    7
3    7
4    6
dtype: int32

In [4]:
data = pd.Series(np.random.randint(10,size=5),\
                 index=["A","B","C","D","E"])
data

A    3
B    4
C    8
D    2
E    5
dtype: int32

In [5]:
data +1

A    4
B    5
C    9
D    3
E    6
dtype: int32

In [6]:
data = data*3
data

A     9
B    12
C    24
D     6
E    15
dtype: int32

In [7]:
data[2:]

C    24
D     6
E    15
dtype: int32

In [8]:
data[::-1]

E    15
D     6
C    24
B    12
A     9
dtype: int32

In [10]:
data[["C","D"]]

C    24
D     6
dtype: int32

In [11]:
ls = ["A","B"]
data[ls]

A     9
B    12
dtype: int32

In [12]:
data.items()

In [13]:
print(data.items())

<zip object at 0x000002B24AA85D08>

In [14]:
for idx, value in data.items():
    print(idx, value)

A 9
B 12
C 24
D 6
E 15

In [15]:
subjects = ["korean", "english", "math", "science"]
points = [100, 80, 90, 60]

In [28]:
converted_dict = {}
for subject, point in zip(subjects, points):
    converted_dict[subject] = point
converted_dict

{'english': 80, 'korean': 100, 'math': 90, 'science': 60}

In [30]:
print(type(converted_dict['english']))

<class 'int'>

In [52]:
converted_series = pd.Series(converted_dict, name="Credits")

converted_series.index.name = "Subject"
converted_series

Subject
english     80
korean     100
math        90
science     60
Name: Credits, dtype: int64

In [53]:
data2 = pd.Series(np.random.randint(5,size=5),index=["A","B","C","E","H"])
data2

A    1
B    1
C    1
E    1
H    4
dtype: int32

In [55]:
data

A     9
B    12
C    24
D     6
E    15
dtype: int32

In [58]:
data3 = data +data2
data3

A    10.0
B    13.0
C    25.0
D     NaN
E    16.0
H     NaN
dtype: float64

In [59]:
print(data3.notnull())

A     True
B     True
C     True
D    False
E     True
H    False
dtype: bool

In [62]:
data3.notnull()

A     True
B     True
C     True
D    False
E     True
H    False
dtype: bool

In [63]:
data3.fillnull(value=0)

AttributeError: 'Series' object has no attribute 'fillnull'

In [65]:
df = pd.DataFrame(columns=["Roll","Actor"])
df

Empty DataFrame
Columns: [Roll, Actor]
Index: []

In [81]:
df["Roll"] = ["tuna","salmon","avocado"]
df["Actor"] = ["Jung","Lee","Park"]
df

   Actor     Roll
s2  Jung     tuna
s3   Lee   salmon
s4  Park  avocado

In [67]:
df["Roll"]

0       tuna
1     salmon
2    avocado
Name: Roll, dtype: object

In [68]:
roll = ["jangeo","egg","umi"]
actor = ["Kimm", "Chang", "Seo"]
roll_dic ={"Roll":roll,"Actor":actor}
roll_dic

{'Actor': ['Kimm', 'Chang', 'Seo'], 'Roll': ['jangeo', 'egg', 'umi']}

In [69]:
df2 = pd.DataFrame(roll_dic)
df2

   Actor    Roll
0   Kimm  jangeo
1  Chang     egg
2    Seo     umi

In [80]:
index_ls = ["s2","s3","s4"]
df2 = pd.DataFrame(roll_dic, index=index_ls)
df2

    Actor    Roll
s2   Kimm  jangeo
s3  Chang     egg
s4    Seo     umi

In [83]:
df.index = ["s0","s1","s2"]

In [84]:
df

   Actor     Roll
s0  Jung     tuna
s1   Lee   salmon
s2  Park  avocado

In [88]:
df2

    Actor    Roll
s2   Kimm  jangeo
s3  Chang     egg
s4    Seo     umi

In [89]:
df2.loc['s5'] = {'Actor': 'Kang', 'Roll': 'chili'}
df2

    Actor    Roll
s2   Kimm  jangeo
s3  Chang     egg
s4    Seo     umi
s5   Kang   chili

In [90]:
df2.loc[len(df)] = {'Actor': 'Son','Roll':'clamb'}
df2

    Actor    Roll
s2   Kimm  jangeo
s3  Chang     egg
s4    Seo     umi
s5   Kang   chili
3     Son   clamb

In [91]:
df2.index =['s3','s4','s5','s6','s7']

In [95]:
df['Price'] = 1000
df

   Actor     Roll  Price
s0  Jung     tuna   1000
s1   Lee   salmon   1000
s2  Park  avocado   1000

In [97]:
def price_count(roll):
    return len(roll) * 1000
price_count('tune')

4000

In [98]:
df['Roll'].apply(price_count)

s0    4000
s1    6000
s2    7000
Name: Roll, dtype: int64

In [100]:
df['Price'] = df['Roll'].apply(price_count)
df

   Actor     Roll  Price
s0  Jung     tuna   4000
s1   Lee   salmon   6000
s2  Park  avocado   7000

In [102]:
df['EA'] = df['Actor'].apply(lambda ea : len(ea))
df

   Actor     Roll  Price  EA
s0  Jung     tuna   4000   4
s1   Lee   salmon   6000   3
s2  Park  avocado   7000   4

In [103]:
import random, string

In [133]:
def get_name():
    names = ['Seydu','Paule','Helena','Cate','Sarah','Mindi','Sandra','Rihana','Ann','Fingersmith']
    return random.choice(names)
def get_mil (start=0, end=30):
    return random.randint(start,end)
def make_data(rows=8):
    rot_list = []
    for _ in range(rows):
        rot_dic = {'Mil':get_mil(), 'Name':get_name()}
        rot_list.append(rot_dic)
    return rot_list

In [143]:
make_data()

[{'Mil': 29, 'Name': 'Sandra'},
 {'Mil': 2, 'Name': 'Seydu'},
 {'Mil': 5, 'Name': 'Mindi'},
 {'Mil': 19, 'Name': 'Ann'},
 {'Mil': 14, 'Name': 'Mindi'},
 {'Mil': 28, 'Name': 'Paule'},
 {'Mil': 0, 'Name': 'Helena'},
 {'Mil': 20, 'Name': 'Rihana'}]

In [145]:
rot1 = pd.DataFrame(make_data())

In [146]:
rot1

   Mil    Name
0   16   Sarah
1   13   Paule
2    9  Rihana
3   26    Cate
4    3     Ann
5    2   Sarah
6    1  Rihana
7   17   Seydu

In [147]:
rot2 = make_data()
rot2 = pd.DataFrame(rot2)
rot2

   Mil         Name
0    1  Fingersmith
1   29       Rihana
2   25  Fingersmith
3    2         Cate
4   23        Seydu
5   26        Mindi
6   25        Seydu
7    0        Seydu

In [137]:
allrot = rot1.append(rot2)
allrot

   Mil         Name
0   15       Sandra
1   14        Paule
2    0  Fingersmith
3   29       Sandra
4   28         Cate
5   28        Sarah
6   13        Mindi
7    1       Rihana
0   13        Mindi
1   27       Sandra
2    5        Seydu
3   24          Ann
4   19        Paule
5    1        Mindi
6   10        Sarah
7   13       Rihana

In [116]:
allrot = allrot.reset_index(drop=True)

In [148]:
allrot = rot1.append(rot2, ignore_index=True)

In [149]:
allrot

    Mil         Name
0    16        Sarah
1    13        Paule
2     9       Rihana
3    26         Cate
4     3          Ann
5     2        Sarah
6     1       Rihana
7    17        Seydu
8     1  Fingersmith
9    29       Rihana
10   25  Fingersmith
11    2         Cate
12   23        Seydu
13   26        Mindi
14   25        Seydu
15    0        Seydu

In [123]:
allrot2 = pd.concat([rot1,rot2]).reset_index(drop=True)
allrot2

    Mil         Name
0     9       Rihana
1    11       Rihana
2    28       Rihana
3    19         Cate
4     0       Rihana
5    14          Ann
6    12       Rihana
7    25        Sarah
8     1       Sandra
9    13        Sarah
10   24          Ann
11    9         Cate
12    0  Fingersmith
13    9          Ann
14    6        Mindi
15   30       Sandra

In [142]:
pd.concat([rot1,rot2], axis=1)

   Mil         Name  Mil    Name
0   15       Sandra   13   Mindi
1   14        Paule   27  Sandra
2    0  Fingersmith    5   Seydu
3   29       Sandra   24     Ann
4   28         Cate   19   Paule
5   28        Sarah    1   Mindi
6   13        Mindi   10   Sarah
7    1       Rihana   13  Rihana

In [129]:
order = pd.concat([df,df2],axis=0)
order

    Actor   EA   Price     Roll
s0   Jung  4.0  4000.0     tuna
s1    Lee  3.0  6000.0   salmon
s2   Park  4.0  7000.0  avocado
s3   Kimm  NaN     NaN   jangeo
s4  Chang  NaN     NaN      egg
s5    Seo  NaN     NaN      umi
s6   Kang  NaN     NaN    chili
s7    Son  NaN     NaN    clamb

In [130]:
allrot

    Mil         Name
0     9       Rihana
1    11       Rihana
2    28       Rihana
3    19         Cate
4     0       Rihana
5    14          Ann
6    12       Rihana
7    25        Sarah
8     1       Sandra
9    13        Sarah
10   24          Ann
11    9         Cate
12    0  Fingersmith
13    9          Ann
14    6        Mindi
15   30       Sandra

In [150]:
allrot.tail()

    Mil   Name
11    2   Cate
12   23  Seydu
13   26  Mindi
14   25  Seydu
15    0  Seydu

In [151]:
lucky = list(allrot["Name"].unique())
len(lucky), lucky

(8,
 ['Sarah', 'Paule', 'Rihana', 'Cate', 'Ann', 'Seydu', 'Fingersmith', 'Mindi'])

In [152]:
allrot.groupby("Name").size()

Name
Ann            1
Cate           2
Fingersmith    2
Mindi          1
Paule          1
Rihana         3
Sarah          2
Seydu          4
dtype: int64

In [153]:
counts = allrot.groupby("Name").size().reset_index(name="how lucky")
counts

          Name  how lucky
0          Ann          1
1         Cate          2
2  Fingersmith          2
3        Mindi          1
4        Paule          1
5       Rihana          3
6        Sarah          2
7        Seydu          4

In [154]:
minim = allrot.groupby("Name").agg('min').reset_index()
minim

          Name  Mil
0          Ann    3
1         Cate    2
2  Fingersmith    1
3        Mindi   26
4        Paule   13
5       Rihana    1
6        Sarah    2
7        Seydu    0

In [157]:
maxi=allrot.groupby("Name").agg('max').reset_index()
maxi

          Name  Mil
0          Ann    3
1         Cate   26
2  Fingersmith   25
3        Mindi   26
4        Paule   13
5       Rihana   29
6        Sarah   16
7        Seydu   25

In [158]:
mean_rot = allrot.groupby("Name").agg('mean').reset_index()
mean_rot

          Name    Mil
0          Ann   3.00
1         Cate  14.00
2  Fingersmith  13.00
3        Mindi  26.00
4        Paule  13.00
5       Rihana  13.00
6        Sarah   9.00
7        Seydu  16.25

In [168]:
all_r = allrot.groupby("Name").agg(['min','max','mean']).reset_index()
all_r

          Name Mil
               min max   mean
0          Ann   3   3   3.00
1         Cate   2  26  14.00
2  Fingersmith   1  25  13.00
3        Mindi  26  26  26.00
4        Paule  13  13  13.00
5       Rihana   1  29  13.00
6        Sarah   2  16   9.00
7        Seydu   0  25  16.25

In [161]:
minim.head(n=3)

          Name  Mil
0          Ann    3
1         Cate    2
2  Fingersmith    1

In [162]:
maxi.tail(n=3)

     Name  Mil
5  Rihana   29
6   Sarah   16
7   Seydu   25

In [172]:
all_r[1:2]

   Name Mil
        min max  mean
1  Cate   2  26  14.0

In [173]:
all_r['Mil']['min']

0     3
1     2
2     1
3    26
4    13
5     1
6     2
7     0
Name: min, dtype: int64

In [174]:
all_r['Mil']['mean']

0     3.00
1    14.00
2    13.00
3    26.00
4    13.00
5    13.00
6     9.00
7    16.25
Name: mean, dtype: float64

In [180]:
rllr = {
    "Name" : all_r["Name"],
    "Mean" : all_r['Mil']['mean'],
    "Maximum" : all_r['Mil']['max'],
    "Minimum" : all_r['Mil']['min'],
}

rllr = pd.DataFrame(rllr)
rllr

   Maximum   Mean  Minimum         Name
0        3   3.00        3          Ann
1       26  14.00        2         Cate
2       25  13.00        1  Fingersmith
3       26  26.00       26        Mindi
4       13  13.00       13        Paule
5       29  13.00        1       Rihana
6       16   9.00        2        Sarah
7       25  16.25        0        Seydu

In [184]:
rllr[rllr['Mean']>10].sort_values(by=['Mean'], ascending=False)

   Maximum   Mean  Minimum         Name
3       26  26.00       26        Mindi
7       25  16.25        0        Seydu
1       26  14.00        2         Cate
2       25  13.00        1  Fingersmith
4       13  13.00       13        Paule
5       29  13.00        1       Rihana

In [189]:
rllr["Counts"] = list(allrot.groupby("Name").size())
rllr

   Maximum   Mean  Minimum         Name  Counts
0        3   3.00        3          Ann       1
1       26  14.00        2         Cate       2
2       25  13.00        1  Fingersmith       2
3       26  26.00       26        Mindi       1
4       13  13.00       13        Paule       1
5       29  13.00        1       Rihana       3
6       16   9.00        2        Sarah       2
7       25  16.25        0        Seydu       4

In [192]:
rllr.sort_values(by=['Mean'], ascending=False,inplace=True)

AttributeError: 'NoneType' object has no attribute 'reset_index'

In [194]:
rllr.reset_index(drop=True, inplace=True)

In [195]:
rllr

   Maximum   Mean  Minimum         Name  Counts
0       26  26.00       26        Mindi       1
1       25  16.25        0        Seydu       4
2       26  14.00        2         Cate       2
3       25  13.00        1  Fingersmith       2
4       13  13.00       13        Paule       1
5       29  13.00        1       Rihana       3
6       16   9.00        2        Sarah       2
7        3   3.00        3          Ann       1

In [196]:
rllr.rename(columns={'Name':'First_Name','Minimum':'Min'}, inplace=True)
rllr

   Maximum   Mean  Min   First_Name  Counts
0       26  26.00   26        Mindi       1
1       25  16.25    0        Seydu       4
2       26  14.00    2         Cate       2
3       25  13.00    1  Fingersmith       2
4       13  13.00   13        Paule       1
5       29  13.00    1       Rihana       3
6       16   9.00    2        Sarah       2
7        3   3.00    3          Ann       1